; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-15)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 p3 - package
    l1 l2 l3 l4 l5 l6 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l4)
    (at p3 l6)
    (at v1 l2)
    (at v2 l1)
    (at v3 l3)
    (road l6 l2)
    (road l1 l2)
    (road l3 l4)
    (road l2 l1)
    (road l4 l3)
    (road l6 l5)
    (road l4 l6)
    (road l6 l4)
    (road l2 l6)
    (road l5 l6)
    (road l2 l3)
    (road l3 l2)
    (road l4 l5)
    (road l5 l4)
    (road l3 l5)
    (road l5 l3)
    (road l1 l6)
    (road l6 l1)
    (road l1 l4)
    (road l4 l1)
    (road l1 l3)
    (road l3 l1)
    (road l2 l4)
    (road l4 l2)
    (road l2 l5)
    (road l5 l2)
    (road l1 l5)
    (road l5 l1)
    )
 (:goal (and 
(at p1 l1)
))
)

; plan
1. (drive v3 l3 l5)
   deleted: (at v3 l3)
   added: (at v3 l5)
   goals met: 0 of 1
2. (pick-up v3 l5 p1 c1 c2)
   deleted: (at p1 l5) (capacity v3 c2)
   added: (in p1 v3) (capacity v3 c1)
   goals met: 0 of 1
3. (drive v3 l5 l1)
   deleted: (at v3 l5)
   added: (at v3 l1)
   goals met: 0 of 1
4. (drop v3 l1 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l1) (capacity v3 c2)
   goals met: 1 of 1
